Учет_ФК/src/Documents/ФормированиеПартийПродукцииДляПереработки/ФормированиеПартийПродукцииДляПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеПартийПродукцииДляПереработки</name>
  <registerRecords>InformationRegister.ДанныеПодготовкиКПереработке</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартииПереработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/InformationRegisters/ДанныеЗатаркиТранспортировочныхМест/ДанныеЗатаркиТранспортировочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗатаркиТранспортировочныхМест</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Documents/ПоступлениеПродукцииИзТранспортировки/ПоступлениеПродукцииИзТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеПродукцииИзТранспортировки</name>
  <basedOn>Document.ТранспортировкаПродукции</basedOn>
  <registerRecords>AccumulationRegister.ПродукцияВПути</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоперевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.ТранспортировкаПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтметкаОПолучении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаВПриемеПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыявленноеНарушение</name>
      <type>
        <types>CatalogRef.ВидыНарушенийПриТранспортировке</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/Documents/ФормированиеПартийПродукцииДляПереработки/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДобавитьДокументыЗаПериод(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзПоступления(Команда)
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		
		
		параметрыФормы = Новый Структура;
		параметрыФормы.Вставить("СкладПолучатель"	,Объект.Склад);
		параметрыФормы.Вставить("Организация"		,Объект.Организация);
		параметрыФормы.Вставить("РежимВыбора"		,Истина);
		параметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца"		,Истина);
		параметрыФормы.Вставить("ЗакрыватьПриВыборе"		,Ложь);
		ФормаВыбора = ПолучитьФорму("Документ.ПоступлениеПродукцииИзТранспортировки.ФормаВыбора",параметрыФормы,ЭтаФорма,,,);	
		ФормаВыбора.Открыть();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Склад";
		Сообщение.ПутьКДанным = "Объект.Склад";
		Сообщение.Текст = "В документе не указан склад, подбор не возможен";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияДокуменПоступленияИзТранспортировкиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ДокументыПоступления.ТекущиеДанные;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ДокументПоступления",ТекущаяСтрока.ДокуменПоступленияИзТранспортировки);
	ТекущаяСтрока.ВесПродукцииПоДокументу  = ПолучитьВесИзДокументаПоступления(СтруктураПараметров);
КонецПроцедуры

&НаСервере
Функция ПолучитьВесИзДокументаПоступления(СтрукутраПараметров)
	ИтоговыйВес = 0;
	ДокументПоступления = СтрукутраПараметров.ДокументПоступления;
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда 
		ИтоговыйВес = ДокументПоступления.ОбщийВес;
	КонецЕсли;
	
	Возврат ИтоговыйВес;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.ПоступлениеПродукцииИзТранспортировки.Форма.ФормаВыбора" Тогда 
		СтруктураДанных  = Новый Структура();
		СтруктураДанных.Вставить("ДокуменПоступленияИзТранспортировки",ВыбранноеЗначение);
		ДобавитьСтрокиДокументаПоПоступлениюНаСервере(СтруктураДанных);
	КонецЕсли;
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ТранспортировочныеМеста.Форма.ФормаВыбора" Тогда 
		СтруктураДанных  = Новый Структура();
		СтруктураДанных.Вставить("ВыбранноеЗначение",ВыбранноеЗначение);
		ДобавитьСтрокуНаСервере(СтруктураДанных);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНаСервере(СтруктураДанных)
	ВыбранноеЗначение = СтруктураДанных.ВыбранноеЗначение;
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("ТранспортировочноеМесто",ВыбранноеЗначение);
	НайденныеСтроки = Объект.Продукция.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.количество() = 0 Тогда 
		НоваяСтр = Объект.Продукция.Добавить();
		НоваяСтр.ТранспортировочноеМесто = ВыбранноеЗначение;
		
		СтруктураДанных = pm_ОбщегоНазначения.ПолучитьДанныеТранспортировочногоМеста(ВыбранноеЗначение);
		ЗаполнитьЗначенияСвойств(НоваяСтр,СтруктураДанных,"ПартияПродукции,ВесБруттоВлажный,ВесНеттоВлажный,НомерПломбы,НомерМестаВПартии");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиДокументаПоПоступлениюНаСервере(СтруктураДанных)
	ДокументПоступления = СтруктураДанных.ДокуменПоступленияИзТранспортировки;
	Для Каждого СтрокаПоступления из ДокументПоступления.Продукция Цикл 
		струкутраПоиска = Новый Структура("ТранспортировочноеМесто",СтрокаПоступления.ТранспортировочноеМесто);
		найденныеСтроки = Объект.Продукция.НайтиСтроки(струкутраПоиска);
		Если найденныеСтроки.Количество() <> 0  Тогда Продолжить; КонецЕсли;
		НоваяСтрока = Объект.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоступления);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияТранспортировочноеМестоПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТранспортировочноеМесто",СтрокаТабличнойЧасти.ТранспортировочноеМесто);
	СтруктураДанных.Вставить("ПартияПродукции","");
	СтруктураДанных.Вставить("ВесБруттоВлажный",0);
	СтруктураДанных.Вставить("ВесНеттоВлажный",0);
	СтруктураДанных.Вставить("НомерПломбы","");
	СтруктураДанных.Вставить("НомерМестаВПартии",0);
	
	ЗаполнитьСтруктуруДанныхНаСервере(СтруктураДанных);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктураДанных,"ПартияПродукции,ВесБруттоВлажный,ВесНеттоВлажный,НомерПломбы,НомерМестаВПартии");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруДанныхНаСервере(СтруктураДанных)
	Если СтруктураДанных.ТранспортировочноеМесто.Пустая() Тогда 
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗатаркиТранспортировочныхМест.Партия КАК Партия,
		|	ДанныеЗатаркиТранспортировочныхМест.ВесБруттоВлажный КАК ВесБруттоВлажный,
		|	ДанныеЗатаркиТранспортировочныхМест.ВесНеттоВлажный КАК ВесНеттоВлажный,
		|	ДанныеЗатаркиТранспортировочныхМест.НомерПломбы КАК НомерПломбы,
		|	ДанныеЗатаркиТранспортировочныхМест.НомерМеста КАК НомерМеста
		|ИЗ
		|	РегистрСведений.ДанныеЗатаркиТранспортировочныхМест КАК ДанныеЗатаркиТранспортировочныхМест
		|ГДЕ
		|	ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто = &ТранспортировочноеМесто";
	
	Запрос.УстановитьПараметр("ТранспортировочноеМесто", СтруктураДанных.ТранспортировочноеМесто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураДанных.ПартияПродукции 	= ВыборкаДетальныеЗаписи.Партия;
		СтруктураДанных.ВесБруттоВлажный 	= ВыборкаДетальныеЗаписи.ВесБруттоВлажный;
		СтруктураДанных.ВесНеттоВлажный 	= ВыборкаДетальныеЗаписи.ВесНеттоВлажный;
		СтруктураДанных.НомерПломбы 		= ВыборкаДетальныеЗаписи.НомерПломбы;
		СтруктураДанных.НомерМестаВПартии 	= ВыборкаДетальныеЗаписи.НомерМеста;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	параметрыФормы = Новый Структура;
	параметрыФормы.Вставить("РежимВыбора"		,Истина);
	параметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца"		,Истина);
	параметрыФормы.Вставить("ЗакрыватьПриВыборе"		,Ложь);
	ФормаВыбора = ПолучитьФорму("Справочник.ТранспортировочныеМеста.ФормаВыбора",параметрыФормы,ЭтаФорма,,,);
	ФормаВыбора.Открыть();

КонецПроцедуры
